# FamilyInstancePlacingArgs Properties

---
The FamilyInstancePlacingArgs type exposes the following members.
| Name| Description
---|---|---
| ActiveView|  The active view
| IsBanned|  Indicates if the cursor is banned or not.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| StatusMessage|  The message to be shown on the status bar
| TooltipMessage|  The message to be shown via tooltip
Top
#### Reference
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace